### Importing the required libraries

In [26]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

import warnings
warnings.filterwarnings('ignore')

### Loading the Data

#### city_target_pax_ratings

In [27]:
city_target_pax_ratings = pd.read_csv('.\\datasets\\csv_files\\city_target_passenger_rating.csv')

print(city_target_pax_ratings.shape)
city_target_pax_ratings.head()

(10, 2)

  city_id  target_avg_passenger_rating
0    CH01                         8.00
1    UP01                         7.25
2    AP01                         8.50
3    MP01                         8.00
4    RJ01                         8.25

#### dim_city

In [28]:
dim_city = pd.read_csv('.\\datasets\\csv_files\\dim_city.csv')
print(dim_city.shape)
dim_city.head()

(10, 2)

  city_id city_name
0    RJ01    Jaipur
1    UP01   Lucknow
2    GJ01     Surat
3    KL01     Kochi
4    MP01    Indore

#### dim_date

In [29]:
dim_date = pd.read_csv('.\\datasets\\csv_files\\dim_date.csv')
print(dim_date.shape)
dim_date.head()

(182, 4)

         date start_of_month month_name day_type
0  2024-01-01     2024-01-01    January  Weekday
1  2024-01-02     2024-01-01    January  Weekday
2  2024-01-03     2024-01-01    January  Weekday
3  2024-01-04     2024-01-01    January  Weekday
4  2024-01-05     2024-01-01    January  Weekday

#### dim_repeat_trip_dist

In [30]:
dim_repeat_trip_dist = pd.read_csv('.\\datasets\\csv_files\\dim_repeat_trip_distribution.csv')
print(dim_repeat_trip_dist.shape)
dim_repeat_trip_dist.head()

(540, 4)

        month city_id trip_count  repeat_passenger_count
0  2024-01-01    AP01   10-Trips                       7
1  2024-01-01    AP01    2-Trips                     352
2  2024-01-01    AP01    3-Trips                     158
3  2024-01-01    AP01    4-Trips                      53
4  2024-01-01    AP01    5-Trips                      38

#### fact_pax_summary

In [31]:
fact_pax_summary = pd.read_csv('.\\datasets\\csv_files\\fact_passenger_summary.csv')
print(fact_pax_summary.shape)
fact_pax_summary.head()

(60, 5)

        month city_id  new_passengers  repeat_passengers  total_passengers
0  2024-01-01    AP01            2513                650              3163
1  2024-01-01    CH01            3920                720              4640
2  2024-01-01    GJ01            2432               1184              3616
3  2024-01-01    GJ02            2089                544              2633
4  2024-01-01    KA01            1957                172              2129

#### fact_trips

In [32]:
fact_trips = pd.read_csv('.\\datasets\\csv_files\\fact_trips.csv')
print(fact_trips.shape)
fact_trips.head()

(425903, 8)

,trip_id,date,city_id,passenger_type,distance_travelled(km),fare_amount,passenger_rating,driver_rating
0,TRPLUC240113d55de2fb,2024-01-13,UP01,repeated,11,158,5,5
1,TRPVAD240129a3b6dba8,2024-01-29,GJ02,repeated,7,74,5,5
2,TRPCOI240107a42430fb,2024-01-07,TN01,repeated,11,155,8,8
3,TRPKOC240325d7601389,2024-03-25,KL01,repeated,36,427,9,10
4,TRPVIS2406027be97166,2024-06-02,AP01,new,17,265,8,8

#### monthly_target_new_passengers

In [33]:
monthly_target_new_passengers = pd.read_csv('.\\datasets\\csv_files\\monthly_target_new_passengers.csv')
print(monthly_target_new_passengers.shape)
monthly_target_new_passengers.head()

(60, 3)

        month city_id  target_new_passengers
0  2024-05-01    GJ01                   1500
1  2024-05-01    GJ02                   1500
2  2024-03-01    GJ01                   2000
3  2024-05-01    UP01                   2000
4  2024-05-01    MP01                   2000

#### monthly_target_trips

In [34]:
monthly_target_trips = pd.read_csv('.\\datasets\\csv_files\\monthly_target_trips.csv')
print(monthly_target_trips.shape)
monthly_target_trips.head()

(60, 3)

        month city_id  total_target_trips
0  2024-03-01    MP01                7000
1  2024-05-01    KA01                2500
2  2024-04-01    UP01               11000
3  2024-02-01    GJ02                6000
4  2024-05-01    KL01                9000

### Merge the dataframes

In [35]:
# Merged the fact_pax_summary with city_target_pax_ratings
df_pax_summary = pd.merge(fact_pax_summary, city_target_pax_ratings, how='left', on=['city_id'])
df_pax_summary.head()

,month,city_id,new_passengers,repeat_passengers,total_passengers,target_avg_passenger_rating
0,2024-01-01,AP01,2513,650,3163,8.5
1,2024-01-01,CH01,3920,720,4640,8.0
2,2024-01-01,GJ01,2432,1184,3616,7.0
3,2024-01-01,GJ02,2089,544,2633,7.5
4,2024-01-01,KA01,1957,172,2129,8.5

In [36]:
# Merged the df_pax_summary with dim_city
df_pax_summary = pd.merge(df_pax_summary, dim_city, how='left', on=['city_id'])
df_pax_summary.head()

,month,city_id,new_passengers,repeat_passengers,total_passengers,target_avg_passenger_rating,city_name
0,2024-01-01,AP01,2513,650,3163,8.5,Visakhapatnam
1,2024-01-01,CH01,3920,720,4640,8.0,Chandigarh
2,2024-01-01,GJ01,2432,1184,3616,7.0,Surat
3,2024-01-01,GJ02,2089,544,2633,7.5,Vadodara
4,2024-01-01,KA01,1957,172,2129,8.5,Mysore

In [38]:
dim_repeat_trip_dist.head()

        month city_id trip_count  repeat_passenger_count
0  2024-01-01    AP01   10-Trips                       7
1  2024-01-01    AP01    2-Trips                     352
2  2024-01-01    AP01    3-Trips                     158
3  2024-01-01    AP01    4-Trips                      53
4  2024-01-01    AP01    5-Trips                      38